{
  "SVC": null,
  "REF": "03",
  "ENV": "P",
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies/$entity",
  "@odata.type": "#microsoft.graph.windows10CompliancePolicy",
  "activeFirewallRequired": true,
  "antiSpywareRequired": true,
  "antivirusRequired": true,
  "bitLockerEnabled": true,
  "codeIntegrityEnabled": false,
  "configurationManagerComplianceRequired": false,
  "createdDateTime": "2021-04-15T18:01:49.568827Z",
  "defenderEnabled": true,
  "defenderVersion": null,
  "description": null,
  "deviceCompliancePolicyScript": null,
  "deviceThreatProtectionEnabled": false,
  "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
  "displayName": "REF-03;ENV-P;VER-01; Device Compliance for Windows",
  "earlyLaunchAntiMalwareDriverEnabled": false,
  "id": "a06d12ed-8595-4d24-8d1b-a37d197a999c",
  "lastModifiedDateTime": "2021-04-15T18:01:49.568827Z",
  "mobileOsMaximumVersion": null,
  "mobileOsMinimumVersion": null,
  "osMaximumVersion": null,
  "osMinimumVersion": null,
  "passwordBlockSimple": true,
  "passwordExpirationDays": null,
  "passwordMinimumCharacterSetCount": null,
  "passwordMinimumLength": 6,
  "passwordMinutesOfInactivityBeforeLock": 15,
  "passwordPreviousPasswordBlockCount": null,
  "passwordRequired": true,
  "passwordRequiredToUnlockFromIdle": false,
  "passwordRequiredType": "deviceDefault",
  "requireHealthyDeviceReport": false,
  "roleScopeTagIds": [
    "0"
  ],
  "rtpEnabled": true,
  "secureBootEnabled": true,
  "signatureOutOfDate": true,
  "storageRequireEncryption": true,
  "tpmRequired": true,
  "validOperatingSystemBuildRanges": [],
  "version": 1
}
