{
  "REF": "03",
  "VER": "2",
  "ENV": "P",
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies/$entity",
  "conditions": {
    "userRiskLevels": [],
    "signInRiskLevels": [],
    "clientAppTypes": [
      "browser",
      "mobileAppsAndDesktopClients"
    ],
    "servicePrincipalRiskLevels": [],
    "platforms": null,
    "locations": null,
    "deviceStates": null,
    "devices": null,
    "clientApplications": null,
    "applications": {
      "includeApplications": [
        "All"
      ],
      "excludeApplications": [
        "00000002-0000-0ff1-ce00-000000000000",
        "00000003-0000-0ff1-ce00-000000000000",
        "09abbdfd-ed23-44ee-a2d9-a627aa1c90f3",
        "2634dd23-5e5a-431c-81ca-11710d9079f4",
        "cc15fd57-2c6c-4117-a88c-83b1d56b4bbe"
      ],
      "includeUserActions": [],
      "includeAuthenticationContextClassReferences": []
    },
    "users": {
      "includeUsers": [],
      "excludeUsers": [],
      "includeGroups": [
        "661e7daa-cacb-404d-b4a4-bbb4c446fe88"
      ],
      "excludeGroups": [
        "2a12a024-c4eb-4afe-bff1-b1cba895fdca"
      ],
      "includeRoles": [],
      "excludeRoles": []
    }
  },
  "createdDateTime": "2021-12-03T20:13:17.3797975Z",
  "displayName": "REF-03;ENV-P;VER-2; Block access, for guests, for all cloud apps, except approved apps",
  "grantControls": {
    "operator": "OR",
    "builtInControls": [
      "block"
    ],
    "customAuthenticationFactors": [],
    "termsOfUse": []
  },
  "id": "738373ec-2e96-4111-9125-e2049cfbe6d9",
  "modifiedDateTime": null,
  "sessionControls": null,
  "state": "disabled"
}
