{
  "REF": "11",
  "VER": "2",
  "ENV": "P",
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies/$entity",
  "conditions": {
    "userRiskLevels": [],
    "signInRiskLevels": [],
    "clientAppTypes": [
      "all"
    ],
    "servicePrincipalRiskLevels": [],
    "platforms": null,
    "locations": null,
    "times": null,
    "deviceStates": null,
    "devices": null,
    "clientApplications": null,
    "applications": {
      "includeApplications": [
        "All"
      ],
      "excludeApplications": [],
      "includeUserActions": [],
      "includeAuthenticationContextClassReferences": []
    },
    "users": {
      "includeUsers": [],
      "excludeUsers": [],
      "includeGroups": [],
      "excludeGroups": [
        "cffbf753-aede-4d0a-b9ff-03f0803c0e62"
      ],
      "includeRoles": [
        "fe930be7-5e62-47db-91af-98c3a49a38b1",
        "69091246-20e8-4a56-aa4d-066075b2a7a8",
        "baf37b3a-610e-45da-9e62-d9d1e5e8914b",
        "75941009-915a-4869-abe7-691bff18279e",
        "f28a1f50-f6e7-4571-818b-6a12f2af6b6c",
        "f023fd81-a637-4b56-95fd-791ac0226033",
        "194ae4cb-b126-40b2-bd5b-6091b380977d",
        "0964bb5e-9bdb-4d7b-ac29-58e794862a40",
        "e8611ab8-c189-46e8-94e1-60213ab1f814",
        "7be44c8a-adaf-4e2a-84d6-ab2649e08a13",
        "11648597-926c-4cf3-9c36-bcebb0ba8dcc",
        "a9ea8996-122f-4c74-9520-8edcd192826c",
        "966707d0-3269-4727-9be2-8c3a10f19b9d",
        "2b745bdf-0803-4d80-aa65-822c4493daac",
        "d37c8bed-0711-4417-ba38-b4abe66ce4c2",
        "4d6ac14f-3453-41d0-bef9-a3e0c569773a",
        "74ef975b-6605-40af-a5d2-b9539d836353",
        "3a2c62db-5318-420d-8d74-23affee5d9d5",
        "8ac3fc64-6eca-42ea-9e69-59f4c7b60eb2",
        "729827e3-9c14-49f7-bb1b-9608f156bbb8",
        "fdd7a751-b60b-444a-984c-02652fe8fa1c",
        "62e90394-69f5-4237-9190-012177145e10",
        "be2f45a1-457d-42af-a067-6ec1fa63bc45",
        "0f971eea-41eb-4569-a71e-57bb8a3eff1e",
        "6e591065-9bad-43ed-90f3-e9424366d2f0",
        "29232cdf-9323-42fd-ade2-1d097af3e4de",
        "44367163-eba1-44c3-98af-f5787879f96a",
        "38a96431-2bdf-4b4c-8b6e-5d3d8abac1a4",
        "b1be1c3e-b65d-4f19-8427-f6fa0d97feb9",
        "e6d1a23a-da11-4be4-9570-befc86d067a7",
        "17315797-102d-40b4-93e0-432062caca18",
        "7698a772-787b-4ac8-901f-60d6b08affd2",
        "158c047a-c907-4556-b7ef-446551a6b5f7",
        "b0f54661-2d74-4c50-afa3-1ec803f12efe",
        "3edaf663-341e-4475-9f94-5c398ef6c070",
        "aaf43236-0c0d-4d5f-883a-6955382ac081",
        "7495fdc4-34c4-4d15-a289-98788ce399fd",
        "e3973bdf-4987-49ae-837a-ba8e231c7286",
        "c4e39bd9-1100-46d3-8c65-fb160da0071f",
        "9b895d92-2cd3-44c7-9d02-a6ac2d5ea5c3",
        "644ef478-e28f-4e28-b9dc-3fdde9aa0b1f",
        "c430b396-e693-46cc-96f3-db01bf8bb62a",
        "0526716b-113d-4c15-b2c8-68e3c22b9f80",
        "8329153b-31d0-4727-b945-745eb3bc5f31",
        "eb1f4a8d-243a-41f0-9fbd-c7cdf6c5ef7c",
        "b5a8dcf3-09d5-43a9-a639-8e29ef291470",
        "3d762c5a-1b6c-493f-843e-55a3b42923d4"
      ],
      "excludeRoles": []
    }
  },
  "createdDateTime": "2021-12-10T13:15:21.4508247Z",
  "displayName": "REF-11;ENV-P;VER-2; Require MFA, for administrators, for all cloud apps",
  "grantControls": {
    "operator": "OR",
    "builtInControls": [
      "mfa"
    ],
    "customAuthenticationFactors": [],
    "termsOfUse": []
  },
  "id": "55c54aa2-643a-4d51-be5d-221b81454757",
  "modifiedDateTime": null,
  "sessionControls": null,
  "state": "disabled"
}
