{
  "REF": "12",
  "VER": "2",
  "ENV": "P",
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies/$entity",
  "conditions": {
    "userRiskLevels": [],
    "signInRiskLevels": [],
    "clientAppTypes": [
      "all"
    ],
    "platforms": null,
    "locations": null,
    "deviceStates": null,
    "devices": null,
    "clientApplications": null,
    "applications": {
      "includeApplications": [
        "797f4846-ba00-4fd7-ba43-dac1f8f63013"
      ],
      "excludeApplications": [],
      "includeUserActions": [],
      "includeAuthenticationContextClassReferences": []
    },
    "users": {
      "includeUsers": [],
      "excludeUsers": [],
      "includeGroups": [
        "fd95ed9f-f1d6-4e01-b07e-9a89a60c1291"
      ],
      "excludeGroups": [
        "369b8c07-fd67-4906-ac74-28edb3b206ff"
      ],
      "includeRoles": [],
      "excludeRoles": []
    }
  },
  "createdDateTime": "2021-03-19T19:59:25.2795264Z",
  "displayName": "REF-12;ENV-P;VER-2; Require MFA, for Azure Management",
  "grantControls": {
    "operator": "OR",
    "builtInControls": [
      "mfa"
    ],
    "customAuthenticationFactors": [],
    "termsOfUse": []
  },
  "id": "589226e4-6e77-471c-8424-87ba40ccbff3",
  "modifiedDateTime": null,
  "sessionControls": null,
  "state": "disabled"
}
