{
  "REF": "15",
  "VER": "1",
  "ENV": "P",
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies/$entity",
  "conditions": {
    "userRiskLevels": [],
    "signInRiskLevels": [],
    "clientAppTypes": [
      "all"
    ],
    "servicePrincipalRiskLevels": [],
    "platforms": null,
    "locations": null,
    "times": null,
    "deviceStates": null,
    "devices": null,
    "clientApplications": null,
    "applications": {
      "includeApplications": [],
      "excludeApplications": [],
      "includeUserActions": [
        "urn:user:registerdevice"
      ],
      "includeAuthenticationContextClassReferences": []
    },
    "users": {
      "includeUsers": [],
      "excludeUsers": [],
      "includeGroups": [
        "c4e5b2a6-7f04-4d81-a1cc-3e9e2738262b"
      ],
      "excludeGroups": [
        "3eb3910c-1af5-4de3-bb54-4cb19f39125b"
      ],
      "includeRoles": [],
      "excludeRoles": []
    }
  },
  "createdDateTime": "2021-12-10T14:59:41.6292416Z",
  "displayName": "REF-15;ENV-P;VER-1; Require MFA, for registering or joining devices",
  "grantControls": {
    "operator": "OR",
    "builtInControls": [
      "mfa"
    ],
    "customAuthenticationFactors": [],
    "termsOfUse": []
  },
  "id": "ef01e75b-bcf1-4e9d-be1e-c6f00047abac",
  "modifiedDateTime": null,
  "sessionControls": null,
  "state": "disabled"
}
