{
  "REF": "03",
  "VER": "2",
  "ENV": "P",
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies/$entity",
  "conditions": {
    "userRiskLevels": [],
    "signInRiskLevels": [],
    "clientAppTypes": [
      "browser",
      "mobileAppsAndDesktopClients"
    ],
    "servicePrincipalRiskLevels": [],
    "platforms": null,
    "locations": null,
    "times": null,
    "deviceStates": null,
    "devices": null,
    "clientApplications": null,
    "users": {
      "includeUsers": [],
      "excludeUsers": [],
      "includeGroups": [
        "8421744c-8c55-45f9-a95b-bb2f896dc1d0"
      ],
      "excludeGroups": [
        "57731cfd-ff4d-494e-a5c8-a21eef2c2657"
      ],
      "includeRoles": [],
      "excludeRoles": []
    }
  },
  "createdDateTime": "2021-12-10T13:15:04.3856568Z",
  "id": "a8b67fcb-7308-4e93-8dfd-db740a9aca5c",
  "modifiedDateTime": null,
  "sessionControls": null,
  "state": null
}
