{
  "REF": "14",
  "VER": "2",
  "ENV": "P",
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies/$entity",
  "conditions": {
    "userRiskLevels": [
      "high"
    ],
    "signInRiskLevels": [],
    "clientAppTypes": [
      "all"
    ],
    "servicePrincipalRiskLevels": [],
    "platforms": null,
    "locations": null,
    "deviceStates": null,
    "devices": null,
    "clientApplications": null,
    "applications": {
      "includeApplications": [
        "All"
      ],
      "excludeApplications": [],
      "includeUserActions": [],
      "includeAuthenticationContextClassReferences": []
    },
    "users": {
      "includeUsers": [],
      "excludeUsers": [],
      "includeGroups": [
        "6ed4f173-f4a2-4535-b357-0b39d456c86c"
      ],
      "excludeGroups": [
        "a4317b1b-fc5d-4d72-baeb-ec88e7fa006f"
      ],
      "includeRoles": [],
      "excludeRoles": []
    }
  },
  "createdDateTime": "2021-12-03T20:41:10.4854515Z",
  "displayName": "REF-14;ENV-P;VER-2; I should be renamed",
  "grantControls": {
    "operator": "AND",
    "builtInControls": [
      "mfa",
      "passwordChange"
    ],
    "customAuthenticationFactors": [],
    "termsOfUse": []
  },
  "id": "a9bbc64b-bfd5-4084-9c14-50168fc6be0d",
  "modifiedDateTime": null,
  "sessionControls": null,
  "state": "disabled"
}
