{
  "REF": "09",
  "VER": "2",
  "ENV": "P",
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies/$entity",
  "conditions": {
    "userRiskLevels": [],
    "signInRiskLevels": [],
    "clientAppTypes": [
      "browser"
    ],
    "platforms": null,
    "locations": null,
    "deviceStates": null,
    "clientApplications": null,
    "applications": {
      "includeApplications": [
        "00000002-0000-0ff1-ce00-000000000000",
        "00000003-0000-0ff1-ce00-000000000000"
      ],
      "excludeApplications": [],
      "includeUserActions": [],
      "includeAuthenticationContextClassReferences": []
    },
    "users": {
      "includeUsers": [],
      "excludeUsers": [],
      "includeGroups": [
        "326a7409-3797-488e-a67c-c1b65fc7aa24"
      ],
      "excludeGroups": [
        "a730b2c2-5a94-4eab-910a-723501bb75bf"
      ],
      "includeRoles": [],
      "excludeRoles": []
    },
    "devices": {
      "includeDeviceStates": [],
      "excludeDeviceStates": [],
      "includeDevices": [
        "All"
      ],
      "excludeDevices": [
        "Compliant",
        "DomainJoined"
      ],
      "deviceFilter": null
    }
  },
  "createdDateTime": "2021-03-16T18:19:05.1930896Z",
  "displayName": "REF-09;ENV-P;VER-2; Require app-enforced restrictions, for Exchange and SharePoint, for all browsers, excluding compliant devices",
  "grantControls": null,
  "id": "812cbd8e-8ea5-460a-9ed9-bd6cd2c0b929",
  "modifiedDateTime": null,
  "sessionControls": {
    "cloudAppSecurity": null,
    "signInFrequency": null,
    "persistentBrowser": null,
    "applicationEnforcedRestrictions": {
      "isEnabled": true
    }
  },
  "state": "disabled"
}
