{
  "REF": "15",
  "VER": "1",
  "ENV": "P",
  "conditions": {
    "userRiskLevels": [],
    "signInRiskLevels": [],
    "clientAppTypes": [
      "all"
    ],
    "servicePrincipalRiskLevels": [],
    "platforms": null,
    "locations": null,
    "deviceStates": null,
    "devices": null,
    "clientApplications": null,
    "applications": {
      "includeApplications": [],
      "excludeApplications": [],
      "includeUserActions": [
        "urn:user:registerdevice"
      ],
      "includeAuthenticationContextClassReferences": []
    },
    "users": {
      "includeUsers": [],
      "excludeUsers": [],
      "includeGroups": [
        "beb29bd3-4261-423b-b71f-716973cbb122"
      ],
      "excludeGroups": [
        "d8c81348-86cd-417c-bff4-24a8fbf3110b"
      ],
      "includeRoles": [],
      "excludeRoles": []
    }
  },
  "createdDateTime": "2021-12-04T17:26:21.5439738Z",
  "displayName": "REF-15;ENV-P;VER-1; Require MFA, for registering or joining devices",
  "grantControls": {
    "operator": "OR",
    "builtInControls": [
      "mfa"
    ],
    "customAuthenticationFactors": [],
    "termsOfUse": []
  },
  "id": "68a19c79-4fd1-4004-ac86-80a7d9f9dd89",
  "modifiedDateTime": "2021-12-05T16:33:40.3120225Z",
  "sessionControls": null,
  "state": "disabled"
}
