{
  "displayName": "REF-15;ENV-P;VER-2; Require MFA for registering or joining devices",
  "state": "disabled",
  "sessionControls": null,
  "conditions": {
      "userRiskLevels": [],
      "signInRiskLevels": [],
      "clientAppTypes": [
          "all"
      ],
      "platforms": null,
      "locations": null,
      "deviceStates": null,
      "devices": null,
      "clientApplications": null,
      "applications": {
          "includeApplications": [],
          "excludeApplications": [],
          "includeUserActions": [
              "urn:user:registerdevice"
          ],
          "includeAuthenticationContextClassReferences": []
      },
      "users": {
          "includeUsers": [
          ],
          "excludeUsers": [],
          "includeGroups": [],
          "excludeGroups": [],
          "includeRoles": [],
          "excludeRoles": []
      }
  },
  "grantControls": {
      "operator": "OR",
      "builtInControls": [
          "mfa"
      ],
      "customAuthenticationFactors": [],
      "termsOfUse": []
  }
}