{
  "REF": "06",
  "VER": "2",
  "ENV": "P",
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies/$entity",
  "conditions": {
    "userRiskLevels": [],
    "signInRiskLevels": [],
    "clientAppTypes": [
      "mobileAppsAndDesktopClients"
    ],
    "locations": null,
    "deviceStates": null,
    "devices": null,
    "clientApplications": null,
    "applications": {
      "includeApplications": [
        "All"
      ],
      "excludeApplications": [],
      "includeUserActions": [],
      "includeAuthenticationContextClassReferences": []
    },
    "users": {
      "includeUsers": [],
      "excludeUsers": [],
      "includeGroups": [
        "22eeaed7-8dec-44b0-ab87-f71ef477c782"
      ],
      "excludeGroups": [
        "55301a42-d05d-4a7d-8a0a-e266a9192a90"
      ],
      "includeRoles": [],
      "excludeRoles": []
    },
    "platforms": {
      "includePlatforms": [
        "all"
      ],
      "excludePlatforms": [
        "android",
        "iOS",
        "windowsPhone"
      ]
    }
  },
  "createdDateTime": "2021-03-18T15:03:23.1671597Z",
  "displayName": "REF-06;ENV-P;VER-2; Require hybrid joined or compliant device, for all cloud apps, for all desktop devices",
  "grantControls": {
    "operator": "OR",
    "builtInControls": [
      "compliantDevice",
      "domainJoinedDevice"
    ],
    "customAuthenticationFactors": [],
    "termsOfUse": []
  },
  "id": "ba0a782d-07bf-4a14-b454-ef3f946cb991",
  "modifiedDateTime": null,
  "sessionControls": null,
  "state": "disabled"
}
