{
  "REF": "10",
  "VER": "2",
  "ENV": "P",
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies/$entity",
  "conditions": {
    "userRiskLevels": [],
    "signInRiskLevels": [],
    "clientAppTypes": [
      "browser"
    ],
    "servicePrincipalRiskLevels": [],
    "platforms": null,
    "locations": null,
    "deviceStates": null,
    "clientApplications": null,
    "applications": {
      "includeApplications": [
        "All"
      ],
      "excludeApplications": [],
      "includeUserActions": [],
      "includeAuthenticationContextClassReferences": []
    },
    "users": {
      "includeUsers": [],
      "excludeUsers": [],
      "includeGroups": [
        "8ddfbdba-221d-4c75-9551-c6184d894bd8"
      ],
      "excludeGroups": [
        "948e96cd-2197-49eb-9241-94f958354066"
      ],
      "includeRoles": [],
      "excludeRoles": []
    },
    "devices": {
      "includeDeviceStates": [],
      "excludeDeviceStates": [],
      "includeDevices": [
        "All"
      ],
      "excludeDevices": [
        "Compliant",
        "DomainJoined"
      ],
      "deviceFilter": null
    }
  },
  "createdDateTime": "2021-12-03T13:04:52.8139909Z",
  "displayName": "REF-10;ENV-P;VER-2; Require daily sign-in frequency with no persistent sessions, for all cloud apps, for all browsers, excluding hybrid joined or compliant devices",
  "grantControls": null,
  "id": "d8241974-bfd1-4ce7-aadf-67f6f34ef813",
  "modifiedDateTime": null,
  "sessionControls": {
    "disableResilienceDefaults": false,
    "applicationEnforcedRestrictions": null,
    "cloudAppSecurity": null,
    "continuousAccessEvaluation": null,
    "signInFrequency": {
      "value": 1,
      "type": "days",
      "isEnabled": true
    },
    "persistentBrowser": {
      "mode": "never",
      "isEnabled": true
    }
  },
  "state": "disabled"
}
