{
  "REF": "15",
  "VER": "2",
  "ENV": "P",
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies/$entity",
  "conditions": {
    "userRiskLevels": [],
    "signInRiskLevels": [],
    "clientAppTypes": [
      "all"
    ],
    "servicePrincipalRiskLevels": [],
    "platforms": null,
    "locations": null,
    "deviceStates": null,
    "devices": null,
    "clientApplications": null,
    "applications": {
      "includeApplications": [],
      "excludeApplications": [],
      "includeUserActions": [
        "urn:user:registerdevice"
      ],
      "includeAuthenticationContextClassReferences": []
    },
    "users": {
      "includeUsers": [],
      "excludeUsers": [],
      "includeGroups": [
        "0e796e20-77ca-47d1-badb-68cfcf9f7099"
      ],
      "excludeGroups": [
        "dc696d9c-dbcd-438f-98a7-6aabae4af8ec"
      ],
      "includeRoles": [],
      "excludeRoles": []
    }
  },
  "createdDateTime": "2021-12-03T20:57:24.8114989Z",
  "displayName": "REF-15;ENV-P;VER-2; Require MFA, for registering or joining devices",
  "grantControls": {
    "operator": "OR",
    "builtInControls": [
      "mfa"
    ],
    "customAuthenticationFactors": [],
    "termsOfUse": []
  },
  "id": "dfc24bfb-abf2-4c8d-81ca-f752baf76abd",
  "modifiedDateTime": null,
  "sessionControls": null,
  "state": "disabled"
}
