{
  "REF": "09",
  "VER": "3",
  "ENV": "P",
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies/$entity",
  "conditions": {
    "userRiskLevels": [],
    "signInRiskLevels": [],
    "clientAppTypes": [
      "browser"
    ],
    "servicePrincipalRiskLevels": [],
    "platforms": null,
    "locations": null,
    "times": null,
    "deviceStates": null,
    "clientApplications": null,
    "applications": {
      "includeApplications": [
        "00000002-0000-0ff1-ce00-000000000000",
        "00000003-0000-0ff1-ce00-000000000000"
      ],
      "excludeApplications": [],
      "includeUserActions": [],
      "includeAuthenticationContextClassReferences": []
    },
    "users": {
      "includeUsers": [],
      "excludeUsers": [],
      "includeGroups": [
        "05bf4f5c-8212-4ac5-a2be-6abffc60cb7d"
      ],
      "excludeGroups": [
        "10a000f7-6881-4cfa-9932-4c07e5ef5710"
      ],
      "includeRoles": [],
      "excludeRoles": []
    },
    "devices": {
      "includeDeviceStates": [],
      "excludeDeviceStates": [],
      "includeDevices": [],
      "excludeDevices": [],
      "deviceFilter": {
        "mode": "include",
        "rule": "device.trustType -ne \"ServerAD\" -or device.isCompliant -ne True"
      }
    }
  },
  "createdDateTime": "2021-12-10T14:59:29.6601983Z",
  "displayName": "REF-09;ENV-P;VER-3; Require app-enforced restrictions, for Exchange and SharePoint, for all browsers, excluding hybrid joined or compliant devices",
  "grantControls": null,
  "id": "28be5e72-ff91-490a-8807-469b141f8b96",
  "modifiedDateTime": null,
  "sessionControls": {
    "disableResilienceDefaults": false,
    "cloudAppSecurity": null,
    "signInFrequency": null,
    "persistentBrowser": null,
    "continuousAccessEvaluation": null,
    "applicationEnforcedRestrictions": {
      "isEnabled": true
    }
  },
  "state": "disabled"
}
