{
  "REF": "03",
  "VER": "2",
  "ENV": "P",
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies/$entity",
  "conditions": {
    "userRiskLevels": [],
    "signInRiskLevels": [],
    "clientAppTypes": [
      "browser",
      "mobileAppsAndDesktopClients"
    ],
    "servicePrincipalRiskLevels": [],
    "platforms": null,
    "locations": null,
    "times": null,
    "deviceStates": null,
    "devices": null,
    "clientApplications": null,
    "users": {
      "includeUsers": [],
      "excludeUsers": [],
      "includeGroups": [
        "f4d78805-b4aa-4b68-911e-36f0f908e978"
      ],
      "excludeGroups": [
        "2c42bfad-b563-4e87-8c39-0768d1f6c408"
      ],
      "includeRoles": [],
      "excludeRoles": []
    }
  },
  "createdDateTime": "2021-12-09T22:03:23.2557484Z",
  "id": "2dd6cdd0-dec9-4dd6-94f8-55a29a977eb2",
  "modifiedDateTime": null,
  "sessionControls": null,
  "state": null
}
