{
  "REF": "15",
  "VER": "1",
  "ENV": "P",
  "conditions": {
    "userRiskLevels": [],
    "signInRiskLevels": [],
    "clientAppTypes": [
      "all"
    ],
    "servicePrincipalRiskLevels": [],
    "platforms": null,
    "locations": null,
    "times": null,
    "deviceStates": null,
    "devices": null,
    "clientApplications": null,
    "applications": {
      "includeApplications": [],
      "excludeApplications": [],
      "includeUserActions": [
        "urn:user:registerdevice"
      ],
      "includeAuthenticationContextClassReferences": []
    },
    "users": {
      "includeUsers": [],
      "excludeUsers": [],
      "includeGroups": [
        "0da6887f-7fba-41f7-b780-25f35cd37b3e"
      ],
      "excludeGroups": [
        "6067ad4a-ff72-452d-8f7f-8b291b29cb8e"
      ],
      "includeRoles": [],
      "excludeRoles": []
    }
  },
  "displayName": "REF-15;ENV-P;VER-1; Require MFA, for registering or joining devices",
  "grantControls": {
    "operator": "OR",
    "builtInControls": [
      "mfa"
    ],
    "customAuthenticationFactors": [],
    "termsOfUse": []
  },
  "id": "b03c4259-4e20-4e97-a0a2-aa4072e971e3",
  "sessionControls": null,
  "state": "disabled"
}
