{
  "REF": "07",
  "VER": "2",
  "ENV": "P",
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies/$entity",
  "conditions": {
    "userRiskLevels": [],
    "signInRiskLevels": [],
    "clientAppTypes": [
      "mobileAppsAndDesktopClients"
    ],
    "locations": null,
    "deviceStates": null,
    "devices": null,
    "clientApplications": null,
    "applications": {
      "includeApplications": [
        "All"
      ],
      "excludeApplications": [],
      "includeUserActions": [],
      "includeAuthenticationContextClassReferences": []
    },
    "users": {
      "includeUsers": [],
      "excludeUsers": [],
      "includeGroups": [
        "bc6f10d5-0333-4a4a-b12b-8712e0718c04"
      ],
      "excludeGroups": [
        "e29b0b30-7923-4dbf-8ef9-691808384319"
      ],
      "includeRoles": [],
      "excludeRoles": []
    },
    "platforms": {
      "includePlatforms": [
        "all"
      ],
      "excludePlatforms": [
        "windows",
        "macOS"
      ]
    }
  },
  "createdDateTime": "2021-03-10T20:06:12.9079686Z",
  "displayName": "REF-07;ENV-P;VER-2; Require approved client app or compliant device, for all cloud apps, for all mobile devices",
  "grantControls": {
    "operator": "OR",
    "builtInControls": [
      "compliantDevice",
      "approvedApplication"
    ],
    "customAuthenticationFactors": [],
    "termsOfUse": []
  },
  "id": "3f7cbc44-8d0a-4739-af5e-821759881278",
  "modifiedDateTime": null,
  "sessionControls": null,
  "state": "disabled"
}
