{
  "SVC": null,
  "REF": "02",
  "ENV": "P",
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/managedAppPolicies/$entity",
  "@odata.type": "#microsoft.graph.iosManagedAppProtection",
  "allowedDataIngestionLocations": [
    "oneDriveForBusiness",
    "sharePoint",
    "camera"
  ],
  "allowedDataStorageLocations": [],
  "allowedInboundDataTransferSources": "allApps",
  "allowedIosDeviceModels": null,
  "allowedOutboundClipboardSharingExceptionLength": 0,
  "allowedOutboundClipboardSharingLevel": "allApps",
  "allowedOutboundDataTransferDestinations": "allApps",
  "appActionIfDeviceComplianceRequired": "block",
  "appActionIfIosDeviceModelNotAllowed": "block",
  "appActionIfMaximumPinRetriesExceeded": "block",
  "appActionIfUnableToAuthenticateUser": null,
  "appDataEncryptionType": "whenDeviceLocked",
  "blockDataIngestionIntoOrganizationDocuments": false,
  "contactSyncBlocked": false,
  "createdDateTime": "2021-04-15T16:46:10.0321927Z",
  "customBrowserProtocol": "",
  "customDialerAppProtocol": "",
  "dataBackupBlocked": false,
  "deployedAppCount": 0,
  "description": "",
  "deviceComplianceRequired": true,
  "dialerRestrictionLevel": "allApps",
  "disableAppPinIfDevicePinIsSet": true,
  "disableProtectionOfManagedOutboundOpenInData": false,
  "displayName": "REF-02;ENV-P;VER-02; App Protection for iOS",
  "exemptedAppProtocols": [
    {
      "name": "Default",
      "value": "skype;app-settings;calshow;itms;itmss;itms-apps;itms-appss;itms-services;"
    }
  ],
  "faceIdBlocked": false,
  "filterOpenInToOnlyManagedApps": false,
  "fingerprintBlocked": false,
  "id": "T_496557c3-e459-484a-b96e-90781a300572",
  "isAssigned": false,
  "lastModifiedDateTime": "2021-04-15T16:46:10.0321927Z",
  "managedBrowser": "notConfigured",
  "managedBrowserToOpenLinksRequired": false,
  "maximumAllowedDeviceThreatLevel": "notConfigured",
  "maximumPinRetries": 5,
  "maximumRequiredOsVersion": null,
  "maximumWarningOsVersion": null,
  "maximumWipeOsVersion": null,
  "minimumPinLength": 6,
  "minimumRequiredAppVersion": null,
  "minimumRequiredOsVersion": null,
  "minimumRequiredSdkVersion": null,
  "minimumWarningAppVersion": null,
  "minimumWarningOsVersion": null,
  "minimumWipeAppVersion": null,
  "minimumWipeOsVersion": null,
  "minimumWipeSdkVersion": null,
  "mobileThreatDefenseRemediationAction": "block",
  "notificationRestriction": "allow",
  "organizationalCredentialsRequired": false,
  "periodBeforePinReset": "PT0S",
  "periodOfflineBeforeAccessCheck": "PT12H",
  "periodOfflineBeforeWipeIsEnforced": "P90D",
  "periodOnlineBeforeAccessCheck": "PT30M",
  "pinCharacterSet": "numeric",
  "pinRequired": true,
  "pinRequiredInsteadOfBiometricTimeout": null,
  "previousPinBlockCount": 0,
  "printBlocked": false,
  "protectInboundDataFromUnknownSources": false,
  "roleScopeTagIds": [
    "0"
  ],
  "saveAsBlocked": false,
  "simplePinBlocked": false,
  "targetedAppManagementLevels": "unspecified",
  "thirdPartyKeyboardsBlocked": false,
  "version": "\"fb6b7774-09ee-4a1f-8db7-8866ca45b49e\""
}
