{
  "SVC": null,
  "REF": "01",
  "ENV": "P",
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/managedAppPolicies/$entity",
  "@odata.type": "#microsoft.graph.androidManagedAppProtection",
  "allowedAndroidDeviceManufacturers": null,
  "allowedAndroidDeviceModels": [],
  "allowedDataIngestionLocations": [
    "oneDriveForBusiness",
    "sharePoint",
    "camera"
  ],
  "allowedDataStorageLocations": [],
  "allowedInboundDataTransferSources": "allApps",
  "allowedOutboundClipboardSharingExceptionLength": 0,
  "allowedOutboundClipboardSharingLevel": "allApps",
  "allowedOutboundDataTransferDestinations": "allApps",
  "appActionIfAndroidDeviceManufacturerNotAllowed": "block",
  "appActionIfAndroidDeviceModelNotAllowed": "block",
  "appActionIfAndroidSafetyNetAppsVerificationFailed": "block",
  "appActionIfAndroidSafetyNetDeviceAttestationFailed": "block",
  "appActionIfDeviceComplianceRequired": "block",
  "appActionIfDeviceLockNotSet": "block",
  "appActionIfMaximumPinRetriesExceeded": "block",
  "appActionIfUnableToAuthenticateUser": null,
  "approvedKeyboards": [],
  "biometricAuthenticationBlocked": false,
  "blockAfterCompanyPortalUpdateDeferralInDays": 0,
  "blockDataIngestionIntoOrganizationDocuments": false,
  "contactSyncBlocked": false,
  "createdDateTime": "2021-04-15T16:46:03.28128Z",
  "customBrowserDisplayName": "",
  "customBrowserPackageId": "",
  "customDialerAppDisplayName": "",
  "customDialerAppPackageId": "",
  "dataBackupBlocked": false,
  "deployedAppCount": 0,
  "description": "",
  "deviceComplianceRequired": true,
  "deviceLockRequired": false,
  "dialerRestrictionLevel": "allApps",
  "disableAppEncryptionIfDeviceEncryptionIsEnabled": false,
  "disableAppPinIfDevicePinIsSet": false,
  "displayName": "REF-01;ENV-P;VER-02; App Protection for Android",
  "encryptAppData": true,
  "exemptedAppPackages": [],
  "fingerprintBlocked": false,
  "id": "T_f5e1f63d-44ac-48b0-95ef-a6ef2cc37e7c",
  "isAssigned": false,
  "keyboardsRestricted": false,
  "lastModifiedDateTime": "2021-04-15T16:46:03.28128Z",
  "managedBrowser": "notConfigured",
  "managedBrowserToOpenLinksRequired": false,
  "maximumAllowedDeviceThreatLevel": "notConfigured",
  "maximumPinRetries": 5,
  "maximumRequiredOsVersion": null,
  "maximumWarningOsVersion": null,
  "maximumWipeOsVersion": null,
  "minimumPinLength": 6,
  "minimumRequiredAppVersion": null,
  "minimumRequiredCompanyPortalVersion": null,
  "minimumRequiredOsVersion": null,
  "minimumRequiredPatchVersion": "0000-00-00",
  "minimumWarningAppVersion": null,
  "minimumWarningCompanyPortalVersion": null,
  "minimumWarningOsVersion": null,
  "minimumWarningPatchVersion": "0000-00-00",
  "minimumWipeAppVersion": null,
  "minimumWipeCompanyPortalVersion": null,
  "minimumWipeOsVersion": null,
  "minimumWipePatchVersion": "0000-00-00",
  "mobileThreatDefenseRemediationAction": "block",
  "notificationRestriction": "allow",
  "organizationalCredentialsRequired": false,
  "periodBeforePinReset": "PT0S",
  "periodOfflineBeforeAccessCheck": "PT12H",
  "periodOfflineBeforeWipeIsEnforced": "P90D",
  "periodOnlineBeforeAccessCheck": "PT30M",
  "pinCharacterSet": "numeric",
  "pinRequired": true,
  "pinRequiredInsteadOfBiometricTimeout": null,
  "previousPinBlockCount": 0,
  "printBlocked": false,
  "requiredAndroidSafetyNetAppsVerificationType": "none",
  "requiredAndroidSafetyNetDeviceAttestationType": "none",
  "requiredAndroidSafetyNetEvaluationType": "basic",
  "roleScopeTagIds": [
    "0"
  ],
  "saveAsBlocked": false,
  "screenCaptureBlocked": false,
  "simplePinBlocked": false,
  "targetedAppManagementLevels": "unspecified",
  "version": "\"af8b7c1d-e469-40f6-8e97-8860cfeee5e7\"",
  "warnAfterCompanyPortalUpdateDeferralInDays": 0,
  "wipeAfterCompanyPortalUpdateDeferralInDays": 0
}
