{
    "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceCompliancePolicies",
    "value": [
        {
            "@odata.type": "#microsoft.graph.windows10CompliancePolicy",
            "roleScopeTagIds": [
                "0"
            ],
            "id": "e8c8b379-af43-4c5c-8df0-a72b7276148d",
            "createdDateTime": "2020-07-07T15:08:20.0938467Z",
            "description": null,
            "lastModifiedDateTime": "2020-11-01T13:56:55.5928833Z",
            "displayName": "REF-03;ENV-P;VER-02; Device Compliance for Windows 10",
            "version": 6,
            "passwordRequired": true,
            "passwordBlockSimple": true,
            "passwordRequiredToUnlockFromIdle": false,
            "passwordMinutesOfInactivityBeforeLock": 15,
            "passwordExpirationDays": null,
            "passwordMinimumLength": 6,
            "passwordMinimumCharacterSetCount": null,
            "passwordRequiredType": "deviceDefault",
            "passwordPreviousPasswordBlockCount": null,
            "requireHealthyDeviceReport": false,
            "osMinimumVersion": null,
            "osMaximumVersion": null,
            "mobileOsMinimumVersion": null,
            "mobileOsMaximumVersion": null,
            "earlyLaunchAntiMalwareDriverEnabled": false,
            "bitLockerEnabled": true,
            "secureBootEnabled": true,
            "codeIntegrityEnabled": false,
            "storageRequireEncryption": true,
            "activeFirewallRequired": true,
            "defenderEnabled": true,
            "defenderVersion": null,
            "signatureOutOfDate": true,
            "rtpEnabled": true,
            "antivirusRequired": true,
            "antiSpywareRequired": true,
            "deviceThreatProtectionEnabled": false,
            "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
            "configurationManagerComplianceRequired": false,
            "tpmRequired": true,
            "deviceCompliancePolicyScript": null,
            "validOperatingSystemBuildRanges": []
        }
    ]
}