{
    "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/notificationMessageTemplates/$entity",
    "id": "5fd70dda-7e3a-4210-84c3-854880f3d0af",
    "lastModifiedDateTime": "2020-12-11T20:38:42Z",
    "displayName": "Endpoint Manager",
    "defaultLocale": "en-gb",
    "brandingOptions": "includeCompanyLogo,includeCompanyName,includeContactInformation",
    "roleScopeTagIds": [
        "0"
    ]
}