{
    "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/androidManagedAppProtections",
    "value": [
        {
            "displayName": "REF-01;ENV-P;VER-02; App Protection for Android",
            "description": "",
            "createdDateTime": "2020-07-20T22:19:14.7672125Z",
            "lastModifiedDateTime": "2020-07-20T22:19:14.7672125Z",
            "roleScopeTagIds": [
                "0"
            ],
            "id": "T_807c2930-1765-4a70-aa13-c5527c6e1aa0",
            "version": "\"ac9daa58-421d-466d-b8f3-7061b3b67afb\"",
            "periodOfflineBeforeAccessCheck": "PT12H",
            "periodOnlineBeforeAccessCheck": "PT30M",
            "allowedInboundDataTransferSources": "allApps",
            "allowedOutboundDataTransferDestinations": "allApps",
            "organizationalCredentialsRequired": false,
            "allowedOutboundClipboardSharingLevel": "allApps",
            "dataBackupBlocked": false,
            "deviceComplianceRequired": true,
            "managedBrowserToOpenLinksRequired": false,
            "saveAsBlocked": false,
            "periodOfflineBeforeWipeIsEnforced": "P90D",
            "pinRequired": true,
            "maximumPinRetries": 5,
            "simplePinBlocked": false,
            "minimumPinLength": 6,
            "pinCharacterSet": "numeric",
            "periodBeforePinReset": "PT0S",
            "allowedDataStorageLocations": [],
            "contactSyncBlocked": false,
            "printBlocked": false,
            "fingerprintBlocked": false,
            "disableAppPinIfDevicePinIsSet": false,
            "maximumRequiredOsVersion": null,
            "maximumWarningOsVersion": null,
            "maximumWipeOsVersion": null,
            "minimumRequiredOsVersion": null,
            "minimumWarningOsVersion": null,
            "minimumRequiredAppVersion": null,
            "minimumWarningAppVersion": null,
            "minimumWipeOsVersion": null,
            "minimumWipeAppVersion": null,
            "appActionIfDeviceComplianceRequired": "block",
            "appActionIfMaximumPinRetriesExceeded": "block",
            "pinRequiredInsteadOfBiometricTimeout": null,
            "allowedOutboundClipboardSharingExceptionLength": 0,
            "notificationRestriction": "allow",
            "previousPinBlockCount": 0,
            "managedBrowser": "notConfigured",
            "maximumAllowedDeviceThreatLevel": "notConfigured",
            "mobileThreatDefenseRemediationAction": "block",
            "blockDataIngestionIntoOrganizationDocuments": false,
            "allowedDataIngestionLocations": [
                "oneDriveForBusiness",
                "sharePoint",
                "camera"
            ],
            "appActionIfUnableToAuthenticateUser": null,
            "dialerRestrictionLevel": "allApps",
            "isAssigned": true,
            "targetedAppManagementLevels": "unspecified",
            "screenCaptureBlocked": false,
            "disableAppEncryptionIfDeviceEncryptionIsEnabled": false,
            "encryptAppData": true,
            "deployedAppCount": 45,
            "minimumRequiredPatchVersion": "0000-00-00",
            "minimumWarningPatchVersion": "0000-00-00",
            "minimumWipePatchVersion": "0000-00-00",
            "allowedAndroidDeviceManufacturers": null,
            "appActionIfAndroidDeviceManufacturerNotAllowed": "block",
            "requiredAndroidSafetyNetDeviceAttestationType": "none",
            "appActionIfAndroidSafetyNetDeviceAttestationFailed": "block",
            "requiredAndroidSafetyNetAppsVerificationType": "none",
            "appActionIfAndroidSafetyNetAppsVerificationFailed": "block",
            "customBrowserPackageId": "",
            "customBrowserDisplayName": "",
            "minimumRequiredCompanyPortalVersion": null,
            "minimumWarningCompanyPortalVersion": null,
            "minimumWipeCompanyPortalVersion": null,
            "keyboardsRestricted": false,
            "allowedAndroidDeviceModels": [],
            "appActionIfAndroidDeviceModelNotAllowed": "block",
            "customDialerAppPackageId": "",
            "customDialerAppDisplayName": "",
            "biometricAuthenticationBlocked": false,
            "requiredAndroidSafetyNetEvaluationType": "basic",
            "blockAfterCompanyPortalUpdateDeferralInDays": 0,
            "warnAfterCompanyPortalUpdateDeferralInDays": 0,
            "wipeAfterCompanyPortalUpdateDeferralInDays": 0,
            "deviceLockRequired": false,
            "appActionIfDeviceLockNotSet": "block",
            "exemptedAppPackages": [],
            "approvedKeyboards": []
        }
    ]
}