{
    "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/iosManagedAppProtections",
    "value": [
        {
            "displayName": "REF-02;ENV-P;VER-02; App Protection for iOS & iPadOS",
            "description": "",
            "createdDateTime": "2020-07-20T22:59:19.5998226Z",
            "lastModifiedDateTime": "2020-07-20T22:59:19.5998226Z",
            "roleScopeTagIds": [
                "0"
            ],
            "id": "T_481ce110-71cf-4407-926d-de146693e823",
            "version": "\"77e7caa4-af47-4d7d-8acd-109a4347ddc8\"",
            "periodOfflineBeforeAccessCheck": "PT12H",
            "periodOnlineBeforeAccessCheck": "PT30M",
            "allowedInboundDataTransferSources": "allApps",
            "allowedOutboundDataTransferDestinations": "allApps",
            "organizationalCredentialsRequired": false,
            "allowedOutboundClipboardSharingLevel": "allApps",
            "dataBackupBlocked": false,
            "deviceComplianceRequired": true,
            "managedBrowserToOpenLinksRequired": false,
            "saveAsBlocked": false,
            "periodOfflineBeforeWipeIsEnforced": "P90D",
            "pinRequired": true,
            "maximumPinRetries": 5,
            "simplePinBlocked": false,
            "minimumPinLength": 6,
            "pinCharacterSet": "numeric",
            "periodBeforePinReset": "PT0S",
            "allowedDataStorageLocations": [],
            "contactSyncBlocked": false,
            "printBlocked": false,
            "fingerprintBlocked": false,
            "disableAppPinIfDevicePinIsSet": true,
            "maximumRequiredOsVersion": null,
            "maximumWarningOsVersion": null,
            "maximumWipeOsVersion": null,
            "minimumRequiredOsVersion": null,
            "minimumWarningOsVersion": null,
            "minimumRequiredAppVersion": null,
            "minimumWarningAppVersion": null,
            "minimumWipeOsVersion": null,
            "minimumWipeAppVersion": null,
            "appActionIfDeviceComplianceRequired": "block",
            "appActionIfMaximumPinRetriesExceeded": "block",
            "pinRequiredInsteadOfBiometricTimeout": null,
            "allowedOutboundClipboardSharingExceptionLength": 0,
            "notificationRestriction": "allow",
            "previousPinBlockCount": 0,
            "managedBrowser": "notConfigured",
            "maximumAllowedDeviceThreatLevel": "notConfigured",
            "mobileThreatDefenseRemediationAction": "block",
            "blockDataIngestionIntoOrganizationDocuments": false,
            "allowedDataIngestionLocations": [
                "oneDriveForBusiness",
                "sharePoint",
                "camera"
            ],
            "appActionIfUnableToAuthenticateUser": null,
            "dialerRestrictionLevel": "allApps",
            "isAssigned": true,
            "targetedAppManagementLevels": "unspecified",
            "appDataEncryptionType": "whenDeviceLocked",
            "minimumRequiredSdkVersion": null,
            "deployedAppCount": 54,
            "faceIdBlocked": false,
            "minimumWipeSdkVersion": null,
            "allowedIosDeviceModels": null,
            "appActionIfIosDeviceModelNotAllowed": "block",
            "thirdPartyKeyboardsBlocked": false,
            "filterOpenInToOnlyManagedApps": false,
            "disableProtectionOfManagedOutboundOpenInData": false,
            "protectInboundDataFromUnknownSources": false,
            "customBrowserProtocol": "",
            "customDialerAppProtocol": "",
            "exemptedAppProtocols": [
                {
                    "name": "Default",
                    "value": "skype;app-settings;calshow;itms;itmss;itms-apps;itms-appss;itms-services;"
                }
            ]
        }
    ]
}